In [1]:
# Apply & Applymap
import numpy as np
import pandas as pd

In [2]:
a1 = ['4등', '3등', '1등', '2등']
a2 = ['마시기', '커피사오기', '만원', '2만원']
idx1 =['송중기', '김나현', '권보아', '박효신']
col1 = ['국어', '영어', '수학']
val1 = [[82, 81, 77], [91, 95, 83], [78, 72, 88], [82, 87, 72]]
s1 = pd.Series(['80점', '75점', '77점', '60점'], index=idx1)
s2 = pd.Series(a1, index=idx1)
s3 = pd.Series(a2, index=['1등', '2등', '3등', '4등'])
df1 = pd.DataFrame(val1, index=idx1, columns=col1)
df2 = df1.applymap(lambda x: str(x) + '점').copy()

In [3]:
# Serie.map
# elementwise, return Series

# Series.apply
# For applying more complex functions on "a Series".

# DataFrame.apply
# Apply a function "row-/column-wise".

# DataFrame.applymap
# Apply a function "elementwise" on a whole DataFrame.

In [4]:
# mapping with dictionary
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s.map({'cat': 'kitten', 'dog': 'puppy'})
# map의 제1 argument는 mapping correspondance, dictionary, function(lambda포함)

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

In [5]:
# Series mapping with function
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [6]:
s1 = s1.map(lambda x: int(x[:2]))
s1

송중기    80
김나현    75
권보아    77
박효신    60
dtype: int64

In [7]:
s.map(lambda x: f"I'm a {x}")

0       I'm a cat
1       I'm a dog
2       I'm a nan
3    I'm a rabbit
dtype: object

In [8]:
# Series간의 mapping (s2:value와 s3:index간에 mapping   🔰)
# left의 value와 right의 index를 mapping
s2.map(s3)

송중기      2만원
김나현       만원
권보아      마시기
박효신    커피사오기
dtype: object

In [15]:
s2

송중기    4등
김나현    3등
권보아    1등
박효신    2등
dtype: object

In [9]:
s3

1등      마시기
2등    커피사오기
3등       만원
4등      2만원
dtype: object

In [10]:
# Series.apply()
s2.apply(lambda x: s3[x])
# 여기서 left의 series를 갖고, 하나씩 value를 꺼내 치환하여 가공된 left를 다시 return한다.

송중기      2만원
김나현       만원
권보아      마시기
박효신    커피사오기
dtype: object

In [17]:
df1.apply(lambda x: x+1, axis=1)
#  axis=1, 0 상관없다

     국어  영어  수학
송중기  83  82  78
김나현  92  96  84
권보아  79  73  89
박효신  83  88  73

In [12]:
df2.applymap(lambda x : x[:2])
# DataFrame을 대상으로 개별요소를 x로 상정한다.

     국어  영어  수학
송중기  82  81  77
김나현  91  95  83
권보아  78  72  88
박효신  82  87  72

In [18]:
df2.apply(lambda x : x[:2], axis=1)
# 매전 가져오는 Series가 row(axis = 1)인가 column(axis = 0)인가가 결정된다.
# 가져온 Series에서 특정값을 참고 하기 위해선 indexing한다.

      국어   영어
송중기  82점  81점
김나현  91점  95점
권보아  78점  72점
박효신  82점  87점

In [14]:
df2['국어'].apply(lambda x : x[:2])
# 이 경우는 처음 부터 Series이며 indexing은 이미 row명으로 한다.

송중기    82
김나현    91
권보아    78
박효신    82
Name: 국어, dtype: object